x = 38
print('дратути!')
if x < 0:
    print('Меньше нуля')
print('дотвидания')

#примеры, блок №1
a, b = 10, 5
if a > b:
    print('a > b')

if a > b and a > 0:
    print('Успех')

if (a > b) and (a > 0 or b < 1000):
    print('Успех')

if 5 < b and b > 10:
    print('Успех')

#блок №2 (сравниваю строки и списки)
if '34' > '123':
    print('Успех')

if '123' > '12':
    print('Успех')

if [1, 2] > [1, 1]:
    print('Успех')

#блок №3 (нельзя сравнивать разные типы данных)
if '6' > 5:
    print('Успех')

if [5, 6] > 5:
    print('Успех')

#НО
if '6' != 5:
    print('Успех')